test/resources/uriAndBinaryObject/curl-request.xml

<soap12:Envelope xmlns:xml="http://www.w3.org/XML/1998/namespace" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns="urn:wco:datamodel:eu:ics2:2">
    <soap12:Header>

        <soap12:MessageID>ad7f2ad2d4f5-4606-99a0-0dd4e52be116</soap12:MessageID>
        <soap12:correlationId>02935d2b-4a7b-4894-8f0c-dfd07b722eag</soap12:correlationId>
        <soap12:messageTimestamp>2023-06-19T09:34:05Z</soap12:messageTimestamp>
        <soap12:messageSender>CR</soap12:messageSender>
        <soap12:messageRecipient>NES.XI</soap12:messageRecipient>
        <soap12:Action>CCN2.Service.Customs.EU.ICS.NESReferralBAS/IE4R02provideAdditionalInformation</soap12:Action>
    </soap12:Header>
    <soap12:Body>
        <ns1:IE4R02provideAdditionalInformationReqMsg xmlns:urn="urn:wco:datamodel:eu:ics2:2"  xmlns:ns1="http://xmlns.ec.eu/BusinessActivityService/ICS/INESReferralBAS/V2">
            <IE4R02>
                <MessageHeader>
                    <messageId>bc39a0ce-6d1a-463e-b449-d621c331b6de</messageId>
                    <correlationId>02935d2b-4a7b-4894-8f0c-dfd07b722eag</correlationId>
                    <messageTimestamp>2023-06-19T09:39:45Z</messageTimestamp>
                    <messageSender>CR</messageSender>
                    <messageRecipient>NES.XI</messageRecipient>
                    <conformanceCampaign>XI XI</conformanceCampaign>
                </MessageHeader>
                <documentIssueDate>
                    <DateTime>2023-06-19T09:39:53Z</DateTime>
                </documentIssueDate>
                <MRN>23XI2CUM4N098fqSMK</MRN>
                <responsibleMemberState>
                    <country>XI</country>
                </responsibleMemberState>
                <representative>
                    <identificationNumber>Umj56W7ogTIHKsok</identificationNumber>
                </representative>
                <transportDocument>
                    <documentNumber>documentNumber15</documentNumber>
                    <type>N740</type>
                </transportDocument>
                <declarant>
                    <identificationNumber>DE647254545643721</identificationNumber>
                </declarant>
                <additionalInformationResponse>
                    <referralRequestReference>2306221687536191</referralRequestReference>
                    <additionalInformation>
                        <code>B01</code>
                        <text>RFI Test1</text>
                        <type>R2</type>
                    </additionalInformation>
                    <binaryAttachment>
                        <filename>202306161445.txt</filename>
                        <MIME>application/text</MIME>
                        <includedBinaryObject>dGhlIHF1aWNrIGJyb3duIGZveCBqdW1wcyBvdmVyIHRoZSBsYXp5IGRvZwo=</includedBinaryObject>
                        <description>202306161445</description>
                    </binaryAttachment>
                    <transportDocumentHouseLevel>
                        <documentNumber>documentNumber15</documentNumber>
                        <type>N740</type>
                    </transportDocumentHouseLevel>
                </additionalInformationResponse>
            </IE4R02>
        </ns1:IE4R02provideAdditionalInformationReqMsg>

    </soap12:Body>
</soap12:Envelope>

